export const softSkillsSeed = [
  {
    value: 'Communication',
    questions: [
      'Расскажи о своем самом эпичном провале.',
      'Почему ты решил(а) сменить работу?',
      'Расскажи про свой лучший и худший день в карьере.',
    ],
  },
  {
    value: 'Listening',
    questions: [
      'Опиши, пожалуйста, самую полезную критику, на твой взгляд, которую ты когда-либо получал(а).',
    ],
  },
  {
    value: 'Time management',
    questions: [
      'Часто ли перерабатывает кандидат? С чем это связано?',
      'Кто занимается планированием задач на текущем месте работы кандидата? Как кандидат планирует свою рабочую неделю? Часто ли не успевает сдать задачу в срок?',
      'Как удается справляться с большими объемами работы? Получается ли правильно расставить приоритеты по задачам?',
    ],
  },
  {
    value: 'Leadership',
    questions: [
      'Был ли опыт построения и запуска новых процессов в компании?',
      'Что самое сложное в том, чтобы быть лидером / руководителем?',
      'Расскажи, пожалуйста, был ли у тебя опыт разрешения конфликтов в команде (с кем этот конфликт был? между кем? как разрешился? как бы ты поступил в такой же ситуации сейчас?)',
    ],
  },
  {
    value: 'Teamwork',
    questions: [
      'Предпочитает работать в команде или в одиночку?',
      'С кем из команды взаимодействует больше всего на текущей должности?',
      'Комфортно ли взаимодействовать с участниками текущей команды?',
      'Как решает спорные ситуации в команде?',
    ],
  },
  {
    value: 'Proactivity',
    questions: [
      'Расскажи о какой-нибудь супер-сложной задаче, с которой приходилось справляться? (Что помогло справиться с этой задачей? Почему решил(а) взяться за эту задачу? Какой результат? Какие выводы?)',
    ],
  },
  {
    value: 'Attention to details',
    questions: [
      'Что бы кандидат делал, если бы запускал собственный проект / продукт?',
      'Случалось ли влиять на процессы на предыдущем месте работы (как? на что это повлияло потом? почему решил(а) изменить процесс? какую проблему решили изменения?)',
      'Случалось ли что-то менять на проекте, что в итоге сыграло большую роль во всем процессе?',
    ],
  },
  {
    value: 'Motivation',
    questions: [
      'Каких профессиональных целей хотел(а) бы достичь кандидат? Что для этого сделал(а) / будет делать? Как поймет, что достиг(ла) поставленной цели?',
      'Как бы ты оценил(а) собственные успехи?',
    ],
  },
  {
    value: 'Match the Dektry team',
    questions: [
      'Опиши команду / компанию мечты.',
      'Что для тебя важно / на что ты обращаешь внимание, приходя в новую команду / компанию?',
    ],
  },
];
